Revit 2024 API
ParameterTypeId.TextStyleUnderline Property
 "Underline"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId TextStyleUnderline { get; }
Visual Basic
Public Shared ReadOnly Property TextStyleUnderline As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ TextStyleUnderline {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace